using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace day11
{
    internal class 构造函数
    {
        //构造函数: 本身是一个函数,当创建该类的实例化对象的时候,构造函数就会执行
        //也就是说 当new一个对象的时候构造函数就会执行
        //构造函数和普通函数的区别: 
        //1. 都是函数,可以传递参数  2.没有返回值  3.必须与类名保持一致
        //4,可以重载 

        //作用:初始化类的成员变量

        //构造函数,无参构造函数
        public 构造函数()
        {

        }
        //构造函数,有参构造函数
        public 构造函数(int a)
        {

        }
        //析构函数: 是一个特殊的成员函数,当对象被释放的时候执行
        //被释放: C#有垃圾回收机制GC 当一个数据没有被任何变量引用的时候,GC会延迟回收
        //习惯函数: 当列的某个实例对象被回收时,会自动调用析构函数
        //析构函数由垃圾回收器控制的,不是最佳实践,不建议使用析构函数,因为GC会自动回收内存,不需要手动释放
        ~构造函数()
        {

        }

        
    }
}
